public class Main {
    public static void main(String[] args) {
        /*
         * Написать класс Circle (круг) и метод, который будет возвращать его площадь.
         */
        Circle c1 = new Circle(10.1);
        System.out.println(c1.getAr());
        System.out.println(c1.toString());



    }
}
